<?php
namespace Settings;

class Main {
    
    static private $keys = [
        "clientType",
        "cityList",
        "clientStatus",
        "competitor",
        "extraService",
        "managerList",
    ];
    
    /*--------------------------------------------------*/
    
    static public function getAll(){
        $result = [];
        foreach(self::$keys as $key){
            $result[$key] = self::$key();
        }
        return $result;
    }
    
    /*--------------------------------------------------*/
    
    static public function udoGiver(){
        return [
            "МВД РК" => "МВД РК",
            "МЮ РК" => "МЮ РК"
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function globalPath(){
        return "/_modules/orkkNew";
    } 
    
    /*--------------------------------------------------*/
    
    static public function dbPath(){ 
        if (
                ($_COOKIE["login"] == "filipp") 
//                || 
//                ($_COOKIE["login"] == "nadezhdat")
        ){
            return "/tmp/orkk";
        }
        else{
            return "/orkk";
        }
        
//        return "/tmp/orkk";
        
    }
    
    /*--------------------------------------------------*/
    
    static public function district(){
        return [
            "Не назначен" => "Не назначен",
            "КЖБИ" => "КЖБИ",
            "КСК" => "КСК",
            "Центр" => "Центр",
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function connectType(){
        return [
            "Оптоволокно" => "Оптоволокно",
            "WiFi" => "WiFi",
            "Utp" => "Utp",
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function streetType(){
        return [
            "" => "",
            "ул." => "ул.",
            "мкрн." => "мкрн.",
            "промзона" => "промзона",
            "пр-кт" => "пр-кт"
        ];
    }
    
    
    /*--------------------------------------------------*/
    
    static public function flatType(){
        return [
            "" => "",
            "Оф." => "Оф.",
            "ВП" => "ВП",
            "Каб." => "Каб.",
            "Кв." => "Кв."
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function buildingType(){
        return [
            "" => "",
            "дом" => "дом",
            "строение" => "строение"
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function payType(){
        return [
            "Безналичный" => "Безналичный",
            "Наличный" => "Наличный"
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function attractType(){
        return [
            "Живая агитация" => "Живая агитация",
            "Входящий звонок" => "Входящий звонок",
            "Партнерская сеть" => "Партнерская сеть",
            "Сайт" => "Сайт"
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function contactType(){
        return [
            "ЛПР" => "ЛПР",
            "Основной" => "Основной",
            "ЭАВР" => "ЭАВР"
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function docPlacement(){
        return [
            "У менеджера" =>  "У менеджера",
            "У клиента" => "У клиента",
            "У офис менеджера" => "У офис менеджера" ,
            "В бухгалтерии" => "В бухгалтерии"
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function clientType(){
        return [
            "ТОО" => "ТОО",
            "ИП" => "ИП",
            "ФЛ" => "ФЛ",
            "ГУ" => "ГУ",
            "АО" => "АО",
            "НЗ" => "НЗ",
            "Другое" => "Другое"
        ];
    }

    /*--------------------------------------------------*/

    static public function cityList(){ 
        return [
            "г. Костанай" => "г. Костанай",
            "г. Лисаковск" => "г. Лисаковск",
            "п. Качар" => "п. Качар",
            "п. Амангельды" => "п. Амангельды",
            "ж.м. Дружба" => "ж.м. Дружба",
            "с. Мичуринское" => "с. Мичуринское"
        ];
    }    

    /*--------------------------------------------------*/

    static public function clientStatus(){
        return [
            "Обход/Диалог" => "Обход/Диалог",
            "Ведутся переговоры" => "Ведутся переговоры",
            "Отключен" => "Отключен",
            "Переоформлен" => "Переоформлен",
            "Подключен" => "Подключен",
            "Отказ НЦ" => "Отказ НЦ",
            "Повторное предложение" => "Повторное предложение",
            "Ожидает подключение" => "Ожидает подключение",
            "Не соответствует ТС" => "Не соответствует ТС",
            "Нет тех. возможности" => "Нет тех. возможности",
            "Приостановлен" =>"Приостановлен"
        ];
    }    
    
    /*--------------------------------------------------*/
      
    static public function clientStatusFirst(){
        return [
            "Обход/Диалог" => "Обход/Диалог",
            "Ведутся переговоры" => "Ведутся переговоры",
            "Отказ НЦ" => "Отказ НЦ",
            "Повторное предложение" => "Повторное предложение",
            "Ожидает подключение" => "Ожидает подключение",
            "Не соответствует ТС" => "Не соответствует ТС",
            "Нет тех. возможности" => "Нет тех. возможности"
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function competitor(){ 
        return [
            "Beeline" => "Beeline",
            "4G" => "4G",
            "ASTEL" => "ASTEL",
            "Davion" => "Davion",
            "TTK" => "TTK",
            "Kazaktelekom" => "Kazaktelekom",
            "Отсутствует" => "Отсутствует",
            "Wi-FI от администрации" => "Wi-FI от администрации",
            "Kazaktelekom для кассовых аппаратов" => "Kazaktelekom для кассовых аппаратов",
            "Astana Megatel" => "Astana Megatel"
        ];
            
    }
    
    /*--------------------------------------------------*/
    
    static public function extraService(){ 
        return[
            "cameras" => "Видеонаблюдение",
            "ipPhone" => "IP телефония",
            "kTv" => "Кабельное ТВ",
            "service" => "Сервисное обслуживание"
        ];
    }    
    
    /*--------------------------------------------------*/
    
    static public function managerList(){
        $profileList = [
            "alibek",
            "romanp",
            "olesya",
            "nadezhdat"
        ];
        $result = [];
        foreach($profileList as $profile){
            $buf = objLoad("/profiles/{$profile}/profile.pro");
            $result[$profile] = isset($buf["uname"]) ? $buf["uname"] : $profile;
        }
        return $result;
    }
    
    /*--------------------------------------------------*/
    
    static public function docType(){
        return [
            "Дополнительная точка" => "Дополнительная точка",
            "Расширение ЛВС" => "Расширение ЛВС",
            "Смена реквизитов" => "Смена реквизитов",
            "Смена местонахождения" => "Смена местонахождения",
            "Увеличение ширины канала" => "Увеличение ширины канала",
            "Уменьшение ширины канала" => "Уменьшение ширины канала",
            "Аренда серверной стойки" => "Аренда серверной стойки",
            "Аренда канала" => "Аренда канала",
            "Обслуживание ЛВС" => "Обслуживание ЛВС",
            "Подключение к сети" => "Подключение к сети",
            "Аренда статического IP адреса" => "Аренда статического IP адреса",
            "Спецификация" => "Спецификация"
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function serviceType(){
        return [
            "Интернет" => "Интернет",
            "ЦОУ" => "ЦОУ",
            "ЕШДИ" => "ЕШДИ",
            "Аренда канала" => "Аренда канала",
            "Обслуживание ЛВС" => "Обслуживание ЛВС",
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function clientDocType(){
        return [
            "Коммерческое предложение" => "Коммерческое предложение",
            "Реквизиты" => "Реквизиты",
            "Заявление" => "Заявление"
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function disconnectType(){
        return [
            "В одностороннем порядке" => "В одностороннем порядке",
            "По заявлению" => "По заявлению",
            "Другое" => "Другое"
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function disconnectReason(){
        return [
            "Дебиторская задолженность" => "Дебиторская задолженность",
            "Не выходит на связь" => "Не выходит на связь",
            "Закрытие бизнеса" => "Закрытие бизнеса",
            "Отключение одной из точек" => "Отключение одной из точек",
            "Уход к конкуренту" => "Уход к конкуренту",
            "Переезд вне МЁ" => "Переезд вне МЁ",
            "Нет потребности" => "Нет потребности"
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function statusColor(){
        return [
            "Обход/Диалог" => "#1A1EB2",
            "Ведутся переговоры" => "#FFAA00",
            "Отключен" => "#A60000",
            "Переоформлен" => "#8A0041",
            "Подключен" => "#008500",
            "Отказ НЦ" => "#696969",
            "Повторное предложение" => "#FF6F00",
            "Ожидает подключение" => "#54026E",
            "Не соответствует ТС" => "#696969",
            "Нет тех. возможности" => "#696969",
            "Приостановлен" => "#1E786C"
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function docPlacementButtonParams(){
        return [
            "У менеджера" =>  [
                "bgColor" => "#FFD700",
                "color" => "var(--modColor_darkest)",
                "text" => "МЕН"
            ],
            "У клиента" => [
                "bgColor" => "#FF4500",
                "color" => "var(--modColor_darkest)",
                "text" => "КЛНТ"
            ],
            "У офис менеджера" => [
                "bgColor" => "#00FFFF",
                "color" => "var(--modColor_darkest)",
                "text" => "ОМЕН"
            ] ,
            "В бухгалтерии" => [
                "bgColor" => "#00FF00",
                "color" => "var(--modColor_darkest)",
                "text" => "БУХ"
            ],
            "Есть" =>  [
                "bgColor" => "var(--modColor)",
                "color" => "white",
                "text" => "ЕСТЬ"
            ],
            "Нет" => [
                "bgColor" => "#B22222",
                "color" => "white",
                "text" => "НЕТ"
            ],
            "Не требуется" => [
                "bgColor" => "#403B3A",
                "color" => "white",
                "text" => "Н.Т."
            ],

        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function profileList(){
        return [
            "manager" => [
                "alibek",
                "romanp",
                "olesya"
            ],
            "leader" => [
                "nadezhdat",
            ],
            "assistant" => [
                "kristinat"
            ],
            "marketer" => [
                "alexa"
            ],
            "admin" => [
                "filipp"
            ]
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function actionBanList(){
        return [
            "deleteClientCard" => [
                "manager",
                "assistant",
                "none"
            ],
            "onlyLeader" => [
                "manager",
                "assistant",
                "none"
            ],
            "managerBan" => [
                "manager"
            ]
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function weekDays(){
        return [
            [
                "short" => "Вс",
                "long" => "Воскресенье"
            ],
            [
                "short" => "Пн",
                "long" => "Понедельник"
            ],
            [
                "short" => "Вт",
                "long" => "Вторник"
            ],
            [
                "short" => "Ср",
                "long" => "Среда"
            ],
            [
                "short" => "Чт",
                "long" => "Четверг"
            ],
            [
                "short" => "Пт",
                "long" => "Пятница"
            ],
            [
                "short" => "Сб",
                "long" => "Суббота"
            ]
        ];
    }
    
    /*--------------------------------------------------*/
    
    static public function roleList(){
        return [
            "manager" => "Менеджер",
            "leader" => "Коммерческий директор",
            "assistant" => "Бухгалтер",
            "marketer" => "Маркетолог",
        ];
    }
    
    /*--------------------------------------------------*/
    
    
}











